[
    {
        "id": "abc",
        "title": "Booki",
        "title-description": "Création de la page d'accueil d'une agence de voyages avec HTML & CSS",
        "description": "Ce projet est un projet de façade, le but était de se familiariser avec le HTML et le Css pour rendre une interface identique à une maquette fournie.\nJ'y ai découvert les flexbox, très utiles pour organiser les différentes cards et avoir un rendu image-légende agréable. L'enjeu de ce projet pour moi a été de comprendre l'utilité des balises HTML, mais aussi leur imbrication les unes dans les autres à l'instar de poupées russes.\nLa grosse difficulté a été de gérer au mieux cette articulation pour facilité un maximum le code Css et par la suite rendre le site responsive. Je me suis rendu compte qu'un mauvais balisage ou imbrication rendait l'étape Css beaucoup plus laborieuse et fastidieuse.\nEn conclusion:\nIl est très important de se concentrer sur une structure HTML propre et précise afin de rendre le codage css et responsive plus agréable.",
        "links": {
            "github": "https://github.com/Laurent-Simon208/Projet-Booki",
            "site":  "https://laurent-simon208.github.io/Projet-Booki/"
        },
        "image": "https://i.imgur.com/KlJMn6x.png",
        "skills": [
            "Html",
            "Css"
        ]
    },
    {
        "id": "abcd",
        "title": "Kasa",
        "title-description": "Création d'une application web de location immobilière avec React",
        "description": "L'objectif de ce projet était de créer le front-end complet d'un site de location immobilière avec React. Ce fut mes premiers pas avec cette bibliothèque et son système de composants.\nJ'ai directement adhéré à cette organisation en étant sensible au JSX qui mêle balisage Html et lignes de code Javascript.\nJe trouve très élégant l'idée d'avoir un site complexe organisé avec de multiples composants très compacts, proposant des fonctions et un rendu HTML dans un seul et même fichier.\nCe projet m'a permis de découvrir Sass et Scss qui me semble être l'évolution parfaite du Css.\nJ'ai tout de même rencontré quelques difficultés dans l'apprentissage, notamment dans la gestion et l'utilisation des props entre dossiers parents-enfants. Il m'a également fallu un certain temps pour maitriser les Hooks les plus courants.\nHeureusement, à force d'entraînement et de tests, j'ai su maitrîser ces outils et j'aborde, maintenant, des notions que je ne connais pas encore beaucoup plus sereinement.  ",
        "links": {
            "github": "https://github.com/Laurent-Simon208/Kasa.git",
            "site":  " https://laurent-simon208.github.io/Kasa/"
        },
        "image": "https://i.imgur.com/jee6PoX.jpg",
        "skills": [
            "Html",
            "Css",
            "React",
            "Sass"
        ]
    },
    {
        "id": "abcde",
        "title": "Mon vieux grimmoire",
        "title-description": "Développer le back-end d'un site de notation de livres",
        "description": "Mon Vieux grimoire est un site de partage de livres avec un système de notation. Le front-end  m'a été fourni et j'ai codé le back-end à partir des spécifications techniques.\nJ'ai trouvé ce projet très intéressant, car j'ai pu découvrir comment sont gérées les requêtes du front-end.\nLorsque j'ai commencé à coder, le plus compliqué a été de faire la distinction entre middleware et CRUD ainsi que de savoir à quel niveau agissait mongosse.\nMaintenant je comprends les mécanismes du back et je sais utiliser les middlewares, gérer les données avec les CRUD, créer des modèles de données et communiquer avec MongoDB grâce à mongoose. Tout ceci en assurant la sécutité du site.\nAprès un apprentissage du front, j'ai trouvé très stimulant de pouvoir créer un environnement back-end complet.\nJe suis fier du rendu final et d'avoir pu rendre opérationnelles toutes les fonctionnalités demandées. ",
        "links": {
            "github": "https://github.com/Laurent-Simon208/mon_vieux_grimoire.git",
            "site":  ""
        },
        "image": "https://i.imgur.com/7VUVxGs.png",
        "skills": [
            "Node",
            "Express"
        ]
    }
    
]

